In [1]:
import numpy as np

In [2]:
import pandas as pd

In [22]:
d = {'A':[1, 2, np.nan], 'B':[np.nan, 3, 5], 'C':[2, np.nan, 3]}

In [23]:
d

{'A': [1, 2, nan], 'B': [nan, 3, 5], 'C': [2, nan, 3]}

In [24]:
d['A'][0]

1

In [25]:
df = pd.DataFrame(d)

In [26]:
df

     A    B    C
0  1.0  NaN  2.0
1  2.0  3.0  NaN
2  NaN  5.0  3.0

In [27]:
df.dropna()

Empty DataFrame
Columns: [A, B, C]
Index: []

In [30]:
df.loc[0][1] = int(input())

3

In [31]:
df.dropna()

     A    B    C
0  1.0  3.0  2.0

In [32]:
df

     A    B    C
0  1.0  3.0  2.0
1  2.0  3.0  NaN
2  NaN  5.0  3.0

In [33]:
df.dropna(axis = 1)

     B
0  3.0
1  3.0
2  5.0

In [41]:
df.dropna(thresh = 3)

     A    B    C
0  1.0  3.0  2.0

In [43]:
df.loc[2][2] = np.nan

In [44]:
df

     A    B    C
0  1.0  3.0  2.0
1  2.0  3.0  NaN
2  NaN  5.0  NaN

In [45]:
df.dropna(thresh = 2)

     A    B    C
0  1.0  3.0  2.0
1  2.0  3.0  NaN

In [46]:
df.fillna(value = 'EMPTY SET')

           A    B          C
0          1  3.0          2
1          2  3.0  EMPTY SET
2  EMPTY SET  5.0  EMPTY SET